Revit 2024 API
RoutingConditions.GetNumberOfConditions Method
 Gets the number of included routing conditions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int GetNumberOfConditions()
Visual Basic
Public Function GetNumberOfConditions As Integer
Visual C++
public:
int GetNumberOfConditions()
See Also
RoutingConditions Class
Autodesk.Revit.DB Namespace